---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipePressureDropData.Density
source: html/807b89ba-968b-1900-f575-19321f3a4b3b.htm
---
# Autodesk.Revit.DB.Plumbing.PipePressureDropData.Density Property

The density of the pipe. Units: (kg/ft³).

## Syntax (C#)
```csharp
public double Density { get; }
```